## Conectando base de datos MySQL a Python con pymysql

In [2]:
#importando librerias
from pymysql import connect
import pandas as pd

In [4]:
#conectando a base de datos mysql
database = connect(host = 'localhost',
                  user = 'root',
                  passwd = 'tyrone4life25652')

#definiendo cursor
cursor = database.cursor()

#definiendo consulta
query = 'show databases'

#ejecutando consulta
cursor.execute(query)

#extrayendo los resultados
dbs = cursor.fetchall()

#imprimiendo resultado de la consulta con una interacion
for data in dbs:
    print(data)

('app',)
('bank',)
('biblio',)
('db2',)
('deltron',)
('escuela',)
('information_schema',)
('mysql',)
('performance_schema',)
('restauranteweb',)
('sakila',)
('sys',)
('talleres',)
('world',)

## Consultando tablas de base de datos seleccionada con Pandas

In [7]:
db1 = connect(host = 'localhost',
             user = 'root',
             passwd = 'tyrone4life25652',
             database = 'deltron')

In [8]:
db1

In [9]:
deltron_tables=pd.read_sql_query('SHOW TABLES FROM deltron',db1)

In [10]:
deltron_tables

  Tables_in_deltron
0      departamento
1          empleado
2        fabricante
3          producto

In [16]:
departamento_df=pd.read_sql_query('SELECT * FROM departamento',db1)
departamento_df

   departamento_id      nombre  presupuesto
0                1  Tecnologia         13.5
1                2      Ventas         27.0
2                5   PostVenta      36000.0

In [17]:
empleado_df=pd.read_sql_query('SELECT * FROM empleado',db1)
empleado_df

   empleado_id        nombres         apelllidos  departamento_id
0            1  Piero Gabriel        Ramos Ocaña                1
1            2  Flor de Maria    Vilchez Salazar                2
2            3  Carlos Enrico  Gutierrez Herbozo                5

In [11]:
fabricante_df=pd.read_sql_query('SELECT * FROM fabricante',db1)
fabricante_df

   fabricante_id  nombre  pais  empleado_id
0              1  Lenovo  Peru            1
1              2     AOC  Peru            2

In [18]:
producto_df=pd.read_sql_query('SELECT * FROM producto',db1)
producto_df

   producto_id          nombre  precio  fabricante_id
0            1   Laptop i5 14"  1170.0              1
1            2  Monitor HD 17"   855.0              2
2            3     Monitor 24"  1080.0              2

In [15]:
empleado_dep_df=pd.read_sql_query("""SELECT e.nombres,e.apelllidos,d.nombre as departamento FROM empleado e 
INNER JOIN departamento d 
ON e.departamento_id=d.departamento_id""",db1)
empleado_dep_df

         nombres         apelllidos departamento
0  Piero Gabriel        Ramos Ocaña   Tecnologia
1  Flor de Maria    Vilchez Salazar       Ventas
2  Carlos Enrico  Gutierrez Herbozo    PostVenta